filtering.md
```{mermaid}
classDiagram

  class nsIMsgFilterService {
    <<Interface>>
    applyFiltersToFolders(filterList, folders, ...)
    applyFilters(filterType, hdrs, ...)
  }

  class nsIMsgFilterList {
    <<Interface>>
    void applyFiltersToHdr(filterType, msgHdr, hitNotify, ...)
  }

  class nsIMsgFilter {
    <<Interface>>
    bool MatchHdr(hdr, ...)
    filterType : nsMsgFilterType
  }

  nsIMsgFilter --> "*" nsIMsgSearchTerm : searchTerms
  nsIMsgFilter --> "1" nsIMsgFilterList : filterList
  nsIMsgFilter "1" --> "*" nsIMsgRuleAction : actionList


  class nsIMsgFilterHitNotify {
    <<Interface>>
    bool applyFilterHit(filter)
  }

  class nsIMsgRuleAction {
    <<Interface>>
    type : nsMsgFilterAction
  }

  nsIMsgFilter <|-- nsMsgFilter
  nsIMsgFilterList <|-- nsMsgFilterList
  nsIMsgFilterService <|-- nsMsgFilterService
  nsIMsgRuleAction <|-- nsMsgRuleAction
  nsIMsgSearchTerm <|-- nsMsgSearchTerm
```
